// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <cstdlib>
using namespace std;

int main()
{
	int a[5];
	int b;
	cin >> a[0];
	cin >> a[1];
	cin >> a[2];
	cin >> a[3];
	cin >> a[4];
	cin >> b;
	int i;

	for (int i =0; i < 5; i++)
	{
		if (a[i] == b)
		{
			cout << "Founded " << b << " in array"<<endl;
		}
		else {
			cout << "Not found"<<endl;

		}
	}
	return 0;
}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//  эхн5йох
//5. Пхкулфз1ър
//фулзоследовательно выберите пункты ХИЛкъуыр
//эжуфклорщйкуэзпцкубдплфкух
//бжэ